Merge pull request #200 from tangsangsimida/v3.1.12
合并 v3.1.12 版本分支
